Tekla Open API Reference for Tekla Structures 2025
GeometryConstants.DISTANCE_EPSILON Field
 The minimum distance used for checking if points, lines, etc. coincide. Anything smaller will be considered equivalent to 0.0.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const double DISTANCE_EPSILON = 0,0001
Public Const DISTANCE_EPSILON As Double = 0,0001
Field Value
Type: Double
See Also
Reference
GeometryConstants Class
Tekla.Structures.Geometry3d Namespace